# 22-09-06 Wed in lecture

## setting

In [11]:
%load_ext sql

In [12]:
%sql sqlite:///db_univ7_new.db

In [13]:
%%sql select *
from sqlite_master;

 * sqlite:///db_univ7_new.db
Done.

[('table', 'classroom', 'classroom', 2, 'CREATE TABLE classroom\n\t(building\t\tvarchar(15),\n\t room_number\t\tvarchar(7),\n\t capacity\t\tnumeric(4,0),\n\t primary key (building, room_number)\n\t)'),
 ('index', 'sqlite_autoindex_classroom_1', 'classroom', 3, None),
 ('table', 'department', 'department', 4, 'CREATE TABLE department\n\t(dept_name\t\tvarchar(20), \n\t building\t\tvarchar(15), \n\t budget\t\t        numeric(12,2) check (budget > 0),\n\t primary key (dept_name)\n\t)'),
 ('index', 'sqlite_autoindex_department_1', 'department', 5, None),
 ('table', 'course', 'course', 6, 'CREATE TABLE course\n\t(course_id\t\tvarchar(8), \n\t title\t\t\tvarchar(50), \n\t dept_name\t\tvarchar(20),\n\t credits\t\tnumeric(2,0) check (credits > 0),\n\t primary key (course_id),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_course_1', 'course', 7, None),
 ('table', 'instructor', 'instructor', 8, 'CREATE TABLE instructor\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t salary\t\t\tnumeric(8,2) check (salary > 29000),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_instructor_1', 'instructor', 9, None),
 ('table', 'section', 'section', 10, "CREATE TABLE section\n\t(course_id\t\tvarchar(8), \n         sec_id\t\t\tvarchar(8),\n\t semester\t\tvarchar(6)\n\t\tcheck (semester in ('Fall', 'Win ... (285 characters truncated) ... (course_id)\n\t\ton delete cascade,\n\t foreign key (building, room_number) references classroom (building, room_number)\n\t\ton delete set null\n\t)"),
 ('index', 'sqlite_autoindex_section_1', 'section', 11, None),
 ('table', 'teaches', 'teaches', 12, 'CREATE TABLE teaches\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnum ... (125 characters truncated) ... ences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references instructor (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_teaches_1', 'teaches', 13, None),
 ('table', 'student', 'student', 14, 'CREATE TABLE student\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t tot_cred\t\tnumeric(3,0) check (tot_cred >= 0),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_student_1', 'student', 15, None),
 ('table', 'takes', 'takes', 16, 'CREATE TABLE takes\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnumer ... (153 characters truncated) ... ferences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_takes_1', 'takes', 17, None),
 ('table', 'advisor', 'advisor', 18, 'CREATE TABLE advisor\n\t(s_ID\t\t\tvarchar(5),\n\t i_ID\t\t\tvarchar(5),\n\t primary key (s_ID),\n\t foreign key (i_ID) references instructor (ID)\n\t\ton delete set null,\n\t foreign key (s_ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_advisor_1', 'advisor', 19, None),
 ('table', 'time_slot', 'time_slot', 20, 'CREATE TABLE time_slot\n\t(time_slot_id\t\tvarchar(4),\n\t day\t\t\tvarchar(1),\n\t start_hr\t\tnumeric(2) check (start_hr >= 0 and start_hr < 24),\n ... (111 characters truncated) ... >= 0 and end_hr < 24),\n\t end_min\t\tnumeric(2) check (end_min >= 0 and end_min < 60),\n\t primary key (time_slot_id, day, start_hr, start_min)\n\t)'),
 ('index', 'sqlite_autoindex_time_slot_1', 'time_slot', 21, None),
 ('table', 'prereq', 'prereq', 22, 'CREATE TABLE prereq\n\t(course_id\t\tvarchar(8), \n\t prereq_id\t\tvarchar(8),\n\t primary key (course_id, prereq_id),\n\t foreign key (course_id) references course (course_id)\n\t\ton delete cascade,\n\t foreign key (prereq_id) references course (course_id)\n\t)'),
 ('index', 'sqlite_autoindex_prereq_1', 'prereq', 23, None)]

In [14]:
%%sql select dept_name
from instructor

 * sqlite:///db_univ7_new.db
Done.

[('Comp. Sci.',),
 ('Finance',),
 ('Music',),
 ('Physics',),
 ('History',),
 ('Physics',),
 ('Comp. Sci.',),
 ('History',),
 ('Finance',),
 ('Biology',),
 ('Comp. Sci.',),
 ('Elec. Eng.',)]

- 1st: from
- 2nd: select

In [15]:
%%sql select *
from instructor as T, instructor as S

 * sqlite:///db_univ7_new.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '12121', 'Wu', 'Finance', 90000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '15151', 'Mozart', 'Music', 40000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '22222', 'Einstein', 'Physics', 95000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '32343', 'El Said', 'History', 60000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '33456', 'Gold', 'Physics', 87000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '58583', 'Califieri', 'History', 62000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '76543', 'Singh', 'Finance', 80000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '76766', 'Crick', 'Biology', 72000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('10101', 'Srinivasan', 'Comp. Sci.', 65000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('12121', 'Wu', 'Finance', 90000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000, '12121', 'Wu', 'Finance', 90000),
 ('12121', 'Wu', 'Finance', 90000, '15151', 'Mozart', 'Music', 40000),
 ('12121', 'Wu', 'Finance', 90000, '22222', 'Einstein', 'Physics', 95000),
 ('12121', 'Wu', 'Finance', 90000, '32343', 'El Said', 'History', 60000),
 ('12121', 'Wu', 'Finance', 90000, '33456', 'Gold', 'Physics', 87000),
 ('12121', 'Wu', 'Finance', 90000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('12121', 'Wu', 'Finance', 90000, '58583', 'Califieri', 'History', 62000),
 ('12121', 'Wu', 'Finance', 90000, '76543', 'Singh', 'Finance', 80000),
 ('12121', 'Wu', 'Finance', 90000, '76766', 'Crick', 'Biology', 72000),
 ('12121', 'Wu', 'Finance', 90000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('12121', 'Wu', 'Finance', 90000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('15151', 'Mozart', 'Music', 40000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('15151', 'Mozart', 'Music', 40000, '12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000, '15151', 'Mozart', 'Music', 40000),
 ('15151', 'Mozart', 'Music', 40000, '22222', 'Einstein', 'Physics', 95000),
 ('15151', 'Mozart', 'Music', 40000, '32343', 'El Said', 'History', 60000),
 ('15151', 'Mozart', 'Music', 40000, '33456', 'Gold', 'Physics', 87000),
 ('15151', 'Mozart', 'Music', 40000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('15151', 'Mozart', 'Music', 40000, '58583', 'Califieri', 'History', 62000),
 ('15151', 'Mozart', 'Music', 40000, '76543', 'Singh', 'Finance', 80000),
 ('15151', 'Mozart', 'Music', 40000, '76766', 'Crick', 'Biology', 72000),
 ('15151', 'Mozart', 'Music', 40000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('15151', 'Mozart', 'Music', 40000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('22222', 'Einstein', 'Physics', 95000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('22222', 'Einstein', 'Physics', 95000, '12121', 'Wu', 'Finance', 90000),
 ('22222', 'Einstein', 'Physics', 95000, '15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000, '22222', 'Einstein', 'Physics', 95000),
 ('22222', 'Einstein', 'Physics', 95000, '32343', 'El Said', 'History', 60000),
 ('22222', 'Einstein', 'Physics', 95000, '33456', 'Gold', 'Physics', 87000),
 ('22222', 'Einstein', 'Physics', 95000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('22222', 'Einstein', 'Physics', 95000, '58583', 'Califieri', 'History', 62000),
 ('22222', 'Einstein', 'Physics', 95000, '76543', 'Singh', 'Finance', 80000),
 ('22222', 'Einstein', 'Physics', 95000, '76766', 'Crick', 'Biology', 72000),
 ('22222', 'Einstein', 'Physics', 95000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('22222', 'Einstein', 'Physics', 95000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('32343', 'El Said', 'History', 60000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('32343', 'El Said', 'History', 60000, '12121', 'Wu', 'Finance', 90000),
 ('32343', 'El Said', 'History', 60000, '15151', 'Mozart', 'Music', 40000),
 ('32343', 'El Said', 'History', 60000, '22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000, '32343', 'El Said', 'History', 60000),
 ('32343', 'El Said', 'History', 60000, '33456', 'Gold', 'Physics', 87000),
 ('32343', 'El Said', 'History', 60000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('32343', 'El Said', 'History', 60000, '58583', 'Califieri', 'History', 62000),
 ('32343', 'El Said', 'History', 60000, '76543', 'Singh', 'Finance', 80000),
 ('32343', 'El Said', 'History', 60000, '76766', 'Crick', 'Biology', 72000),
 ('32343', 'El Said', 'History', 60000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('32343', 'El Said', 'History', 60000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('33456', 'Gold', 'Physics', 87000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('33456', 'Gold', 'Physics', 87000, '12121', 'Wu', 'Finance', 90000),
 ('33456', 'Gold', 'Physics', 87000, '15151', 'Mozart', 'Music', 40000),
 ('33456', 'Gold', 'Physics', 87000, '22222', 'Einstein', 'Physics', 95000),
 ('33456', 'Gold', 'Physics', 87000, '32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000, '33456', 'Gold', 'Physics', 87000),
 ('33456', 'Gold', 'Physics', 87000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('33456', 'Gold', 'Physics', 87000, '58583', 'Califieri', 'History', 62000),
 ('33456', 'Gold', 'Physics', 87000, '76543', 'Singh', 'Finance', 80000),
 ('33456', 'Gold', 'Physics', 87000, '76766', 'Crick', 'Biology', 72000),
 ('33456', 'Gold', 'Physics', 87000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('33456', 'Gold', 'Physics', 87000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '12121', 'Wu', 'Finance', 90000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '15151', 'Mozart', 'Music', 40000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '22222', 'Einstein', 'Physics', 95000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '32343', 'El Said', 'History', 60000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '58583', 'Califieri', 'History', 62000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '76543', 'Singh', 'Finance', 80000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '76766', 'Crick', 'Biology', 72000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('45565', 'Katz', 'Comp. Sci.', 75000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('58583', 'Califieri', 'History', 62000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('58583', 'Califieri', 'History', 62000, '12121', 'Wu', 'Finance', 90000),
 ('58583', 'Califieri', 'History', 62000, '15151', 'Mozart', 'Music', 40000),
 ('58583', 'Califieri', 'History', 62000, '22222', 'Einstein', 'Physics', 95000),
 ('58583', 'Califieri', 'History', 62000, '32343', 'El Said', 'History', 60000),
 ('58583', 'Califieri', 'History', 62000, '33456', 'Gold', 'Physics', 87000),
 ('58583', 'Califieri', 'History', 62000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000, '58583', 'Califieri', 'History', 62000),
 ('58583', 'Califieri', 'History', 62000, '76543', 'Singh', 'Finance', 80000),
 ('58583', 'Califieri', 'History', 62000, '76766', 'Crick', 'Biology', 72000),
 ('58583', 'Califieri', 'History', 62000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('58583', 'Califieri', 'History', 62000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('76543', 'Singh', 'Finance', 80000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('76543', 'Singh', 'Finance', 80000, '12121', 'Wu', 'Finance', 90000),
 ('76543', 'Singh', 'Finance', 80000, '15151', 'Mozart', 'Music', 40000),
 ('76543', 'Singh', 'Finance', 80000, '22222', 'Einstein', 'Physics', 95000),
 ('76543', 'Singh', 'Finance', 80000, '32343', 'El Said', 'History', 60000),
 ('76543', 'Singh', 'Finance', 80000, '33456', 'Gold', 'Physics', 87000),
 ('76543', 'Singh', 'Finance', 80000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('76543', 'Singh', 'Finance', 80000, '58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000, '76543', 'Singh', 'Finance', 80000),
 ('76543', 'Singh', 'Finance', 80000, '76766', 'Crick', 'Biology', 72000),
 ('76543', 'Singh', 'Finance', 80000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('76543', 'Singh', 'Finance', 80000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('76766', 'Crick', 'Biology', 72000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('76766', 'Crick', 'Biology', 72000, '12121', 'Wu', 'Finance', 90000),
 ('76766', 'Crick', 'Biology', 72000, '15151', 'Mozart', 'Music', 40000),
 ('76766', 'Crick', 'Biology', 72000, '22222', 'Einstein', 'Physics', 95000),
 ('76766', 'Crick', 'Biology', 72000, '32343', 'El Said', 'History', 60000),
 ('76766', 'Crick', 'Biology', 72000, '33456', 'Gold', 'Physics', 87000),
 ('76766', 'Crick', 'Biology', 72000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('76766', 'Crick', 'Biology', 72000, '58583', 'Califieri', 'History', 62000),
 ('76766', 'Crick', 'Biology', 72000, '76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000, '76766', 'Crick', 'Biology', 72000),
 ('76766', 'Crick', 'Biology', 72000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('76766', 'Crick', 'Biology', 72000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '12121', 'Wu', 'Finance', 90000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '15151', 'Mozart', 'Music', 40000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '22222', 'Einstein', 'Physics', 95000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '32343', 'El Said', 'History', 60000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '33456', 'Gold', 'Physics', 87000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '58583', 'Califieri', 'History', 62000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '76543', 'Singh', 'Finance', 80000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000, '98345', 'Kim', 'Elec. Eng.', 80000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '12121', 'Wu', 'Finance', 90000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '15151', 'Mozart', 'Music', 40000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '22222', 'Einstein', 'Physics', 95000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '32343', 'El Said', 'History', 60000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '33456', 'Gold', 'Physics', 87000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '45565', 'Katz', 'Comp. Sci.', 75000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '58583', 'Califieri', 'History', 62000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '76543', 'Singh', 'Finance', 80000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '76766', 'Crick', 'Biology', 72000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000, '98345', 'Kim', 'Elec. Eng.', 80000)]

In [16]:
%%sql select distinct T. name
from instructor as T, instructor as S
where T.salary > S.salary and S.dept_name = 'Comp. Sci.'

 * sqlite:///db_univ7_new.db
Done.

[('Wu',),
 ('Einstein',),
 ('Gold',),
 ('Katz',),
 ('Singh',),
 ('Crick',),
 ('Brandt',),
 ('Kim',)]

## string operations
- %: matches any string
- _:       
    - ex) '%Comp%' -> ~Comp~
    - ex) '___%' -> 3

In [17]:
%%sql
select name
from instructor
where name like '%ran%'

 * sqlite:///db_univ7_new.db
Done.

[('Brandt',)]

In [18]:
%%sql
insert into instructor
values ('99998','Lee%','Biology',90000)

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [19]:
%sql insert into instructor values ('99999','Lee2','Biology',90000)

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [20]:
%sql select * from instructor

 * sqlite:///db_univ7_new.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000),
 ('99998', 'Lee%', 'Biology', 90000),
 ('99999', 'Lee2', 'Biology', 90000)]

In [21]:
%sql select name from instructor where name like 'Lee%'

 * sqlite:///db_univ7_new.db
Done.

[('Lee%',), ('Lee2',)]

### escape
- ex)  "100%"  <- like '100\%' escape '\ '

In [22]:
%sql select name from instructor where name like 'Lee\%' escape '\'

 * sqlite:///db_univ7_new.db
Done.

[('Lee%',)]

In [23]:
%sql delete from instructor where name like 'Lee%'

 * sqlite:///db_univ7_new.db
2 rows affected.

[]

In [24]:
%sql select * from instructor

 * sqlite:///db_univ7_new.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

In [25]:
%sql select name from instructor where name like '___'

 * sqlite:///db_univ7_new.db
Done.

[('Kim',)]

In [26]:
%sql select name from instructor where name like '_____%'

 * sqlite:///db_univ7_new.db
Done.

[('Srinivasan',),
 ('Mozart',),
 ('Einstein',),
 ('El Said',),
 ('Califieri',),
 ('Singh',),
 ('Crick',),
 ('Brandt',)]

## ordering
- order by [attribute] (decs)

In [27]:
%%sql
select distinct name
from instructor order by name

 * sqlite:///db_univ7_new.db
Done.

[('Brandt',),
 ('Califieri',),
 ('Crick',),
 ('Einstein',),
 ('El Said',),
 ('Gold',),
 ('Katz',),
 ('Kim',),
 ('Mozart',),
 ('Singh',),
 ('Srinivasan',),
 ('Wu',)]

In [28]:
%sql select distinct name from instructor order by name desc

 * sqlite:///db_univ7_new.db
Done.

[('Wu',),
 ('Srinivasan',),
 ('Singh',),
 ('Mozart',),
 ('Kim',),
 ('Katz',),
 ('Gold',),
 ('El Said',),
 ('Einstein',),
 ('Crick',),
 ('Califieri',),
 ('Brandt',)]

In [29]:
%sql select distinct dept_name, name from instructor order by dept_name, name desc

 * sqlite:///db_univ7_new.db
Done.

[('Biology', 'Crick'),
 ('Comp. Sci.', 'Srinivasan'),
 ('Comp. Sci.', 'Katz'),
 ('Comp. Sci.', 'Brandt'),
 ('Elec. Eng.', 'Kim'),
 ('Finance', 'Wu'),
 ('Finance', 'Singh'),
 ('History', 'El Said'),
 ('History', 'Califieri'),
 ('Music', 'Mozart'),
 ('Physics', 'Gold'),
 ('Physics', 'Einstein')]

## between
- where [attribute] between [value] and [value]

In [30]:
%sql select name  from instructor where salary between 90000 and 100000

 * sqlite:///db_univ7_new.db
Done.

[('Wu',), ('Einstein',), ('Brandt',)]

In [31]:
%sql select name, course_id from instructor, teaches where (instructor.ID, dept_name) = (teaches.ID, 'Biology')

 * sqlite:///db_univ7_new.db
Done.

[('Crick', 'BIO-101'), ('Crick', 'BIO-301')]

## set operations
- duplicate  default
- duplicate  union/intersect/except **all**

### union
- [query] union [query]

In [32]:
%%sql select course_id from section where semester = 'Fall' and year = 2017
union
select course_id from section where semester = 'Spring' and year = 2018

 * sqlite:///db_univ7_new.db
Done.

[('CS-101',),
 ('CS-315',),
 ('CS-319',),
 ('CS-347',),
 ('FIN-201',),
 ('HIS-351',),
 ('MU-199',),
 ('PHY-101',)]

### intersect
- [query] intersect [query]

In [33]:
%%sql select course_id from section where semester = 'Fall' and year = 2017
intersect
select course_id from section where semester = 'Spring' and year = 2018

 * sqlite:///db_univ7_new.db
Done.

[('CS-101',)]

### except
- [query] except [query]

In [34]:
%%sql
select course_id from section where semester = 'Fall' and year = 2017
except
select course_id from section where semester = 'Spring' and year = 2018

 * sqlite:///db_univ7_new.db
Done.

[('CS-347',), ('PHY-101',)]

## null value
- where [attribute] **is null**
- ex) 5<null, null><null, null=null --> unknown
- true -> unknown -> false
    - ex) true and unknown --> unknown --> return nothing
    - ex) true or unknown --> true

In [35]:
%%sql
select name
from instructor
where salary is null

 * sqlite:///db_univ7_new.db
Done.

[]

In [36]:
%sql select name from instructor where salary > null

 * sqlite:///db_univ7_new.db
Done.

[]

In [37]:
%sql insert into instructor values ('88888','Choi','Biology', null)

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [38]:
%sql select name from instructor where salary is null

 * sqlite:///db_univ7_new.db
Done.

[('Choi',)]

In [39]:
%sql delete from instructor where salary is null

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

 , **dept_name = 'Comp. Sci.' or salary > null**  **salary > null** unknown ,   .

In [40]:
%sql select * from instructor where dept_name = 'Comp. Sci.' or salary > null

 * sqlite:///db_univ7_new.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000)]

In [41]:
%sql select * from instructor where dept_name = 'Comp. Sci.'

 * sqlite:///db_univ7_new.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000)]

## aggregate funtions
- avg
- count
- min, max
- sum

### avg([attribute])

In [42]:
%sql select avg(salary) from instructor where dept_name = 'Comp. Sci.'

 * sqlite:///db_univ7_new.db
Done.

[(77333.33333333333,)]

### count([attribute])

In [43]:
%sql select count (distinct ID) from teaches where semester = 'Spring' and year = 2018

 * sqlite:///db_univ7_new.db
Done.

[(6,)]

In [44]:
%sql select * from course

 * sqlite:///db_univ7_new.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

In [45]:
%sql select count (*) from course;

 * sqlite:///db_univ7_new.db
Done.

[(13,)]

### group by [attribute]

In [46]:
%sql select dept_name, avg (salary) from instructor group by dept_name;

 * sqlite:///db_univ7_new.db
Done.

[('Biology', 72000.0),
 ('Comp. Sci.', 77333.33333333333),
 ('Elec. Eng.', 80000.0),
 ('Finance', 85000.0),
 ('History', 61000.0),
 ('Music', 40000.0),
 ('Physics', 91000.0)]

-   , **ID**   ..  (  )

In [47]:
%sql select dept_name, ID, avg (salary) from instructor group by dept_name;

 * sqlite:///db_univ7_new.db
Done.

[('Biology', '76766', 72000.0),
 ('Comp. Sci.', '10101', 77333.33333333333),
 ('Elec. Eng.', '98345', 80000.0),
 ('Finance', '12121', 85000.0),
 ('History', '32343', 61000.0),
 ('Music', '15151', 40000.0),
 ('Physics', '22222', 91000.0)]

### having []
->  where    
- contingency table  
- where , **group by**

-   
1. from
2. where
3. group by
4. having
5. select

In [48]:
%%sql select dept_name, avg (salary)
from instructor
group by dept_name
having avg (salary) > 42000;

 * sqlite:///db_univ7_new.db
Done.

[('Biology', 72000.0),
 ('Comp. Sci.', 77333.33333333333),
 ('Elec. Eng.', 80000.0),
 ('Finance', 85000.0),
 ('History', 61000.0),
 ('Physics', 91000.0)]

## nested subquery

### set membership
1. select -> subquery that single value
2. from -> any valid subquery
3. where -> [attribute] [operation] [subquery]

- in

In [49]:
%%sql
select distinct course_id
from section
where semester = 'Fall'
    and year= 2017 
    and course_id
        in (select course_id from section where semester = 'Spring' and year= 2018);

 * sqlite:///db_univ7_new.db
Done.

[('CS-101',)]

In [2]:
%%sql select course_id
from section
where semester = 'Spring' and year= 2018;

UsageError: Cell magic `%%sql` not found.

- not in

In [3]:
%%sql select distinct course_id
from section
where semester = 'Fall' and year= 2017 
    and course_id
        not in(select course_id from section where semester = 'Spring' and year= 2018);

UsageError: Cell magic `%%sql` not found.

In [4]:
%%sql select count (distinct ID)
from takes
where (course_id, sec_id, semester, year) in (select course_id, sec_id, semester, year
                                        from teaches
                                         where teaches.ID= 10101);

UsageError: Cell magic `%%sql` not found.

In [5]:
%%sql select *
from takes as S, teaches as T
where S.course_id = T.course_id
and S.sec_id = T.sec_id
and S.semester = T.semester
and S.year = T.year
and T.ID= 10101;

UsageError: Cell magic `%%sql` not found.

In [6]:
%%sql select count(distinct S.ID)
from takes as S, teaches as T
where S.course_id = T.course_id
and S.sec_id = T.sec_id
and S.semester = T.semester
and S.year = T.year
and T.ID= 10101;

UsageError: Cell magic `%%sql` not found.

## set comparison(SQLite   )
- some
- all

### some
- ex) 5 < some[0,5,6] --> true

In [7]:
%%sql select name
from instructor as T, instructor as S
where T.salary > S.salary and S.dept_name = 'Biology';

UsageError: Cell magic `%%sql` not found.

-   
-

In [8]:
%%sql select name
from instructor
where salary > some (select salary
                     from instructor
                    where dept_name = 'Biology');

UsageError: Cell magic `%%sql` not found.

In [9]:
%%sql select name
from instructor
where salary > (select salary
                     from instructor
                    where dept_name = 'Biology');

UsageError: Cell magic `%%sql` not found.

### all
- ex) 5 < all[6,10] --> true

In [10]:
%%sql select name
from instructor
where salary > all (select salary
                     from instructor
                    where dept_name = 'Biology');

UsageError: Cell magic `%%sql` not found.